import { namespaces } from '../../i18n/i18n.constants'

export const jp = {
  [namespaces.common]: {
    buttons: {
      ok: 'はい',
      cancel: 'いいえ',
    },
    construction: '工事中!',
  },
  [namespaces.pages.about]: {
    para0:
      '触覚とアナログタッチのひねりを加えたアーケードゲーム！そして、やる気のない猫も付いてくる！複数のスライダーを駆使して特殊コントロールを使って、色んな触覚フィードバックを感じで、たくさんのペストリー作りにチャレンジしましょう。',
    para1:
      'ペストリーパニック（＋猫）は触覚フィードバックがある特殊コントローラーでプレイするアーケードゲームです。',
    para2:
      'このシングルプレイのゲームでは、調理道具を模したインプットスライダーを差し替えながら、制限時間内にできるだけたくさんのペストリーを焼いていきます。コントローラーには画面左右のペストリーが流れてくるベルトコンベアと一致するインプットスロットが2つと、5つのアクションがあります。',
    para3:
      '触覚フィードバックを感じるスライダーで各アクションを実行できます。1回だけ押すと切る、1. 連打するとこねる、押しっぱなしにすると詰める、スライダーを上下に振るとまぶす（ただし、押し込みすぎると失敗する）、 所定の場所に入れることでペストリーを焼く（焼けたら外す）。',
    para4:
      '調理途中のペストリーがベルトコンベアに流れてきて、プレイヤーはそれに対してそれぞれ異なるアクションをして仕上げる必要があります。それぞれのペストリーを作るために必要な固有のアクションは現物のレシピ本に記載されており、これで作り方を調べながらアクションを実行していきます。',
    para5:
      '複数のスライダーを使いこなしてアクションを実行したり、レシピ本を確認したり、2つのペストリーを同時に仕上げたり、画面とアナログのコントローラーや本を行ったり来たりするなど、ペストリーパニックははちゃめちゃなプレイ体験を提供します。',
  },
}
